samples/SOAP XML/IOS+/ServiceSessionStart_response.xml


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <ServiceSessionStart xmlns="http://webservices.iress.com.au/v4/">
      <Input>
        <Header>
          <ServiceSessionKey>81F43649-1E9A-4ADF-94BD-F257D078C987@IDS-TEST</ServiceSessionKey>
          <RequestID></RequestID>
          <Updates>false</Updates>
          <Timeout>25</Timeout>
          <PageSize>1000</PageSize>
          <WaitForResponse>true</WaitForResponse>
          <PagingBookmark />
          <PagingDirection>0</PagingDirection>
          <InputLocalizationType>0</InputLocalizationType>
          <OutputLocalizationType>0</OutputLocalizationType>
        </Header>
        <Parameters>
          <IRESSSessionKey>9758A6F2-0ACA-4033-8A80-38AF2D89D925-3E7544BD-00C8-000A-0001-0147@IDS-TEST</IRESSSessionKey>
          <Service>IOSPLUS</Service>
          <Server>IOSPLUSAPIRETAIL3</Server>
          <AllowSessionToEndOnAccessChanges>false</AllowSessionToEndOnAccessChanges>
        </Parameters>
      </Input>
    </ServiceSessionStart>
  </soap:Body>
</soap:Envelope>